// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
Console.WriteLine("Homework #2");

Console.WriteLine("Введите своё число:");
string str_number = Console.ReadLine();


Console.WriteLine(str_number[1]);
